RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_i2s.h
/**
  ******************************************************************************
  * @file    stm32h7xx_hal_i2s.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    21-April-2017
  * @brief   Header file of I2S HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32H7xx_HAL_I2S_H
#define __STM32H7xx_HAL_I2S_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal_def.h"

/** @addtogroup STM32H7xx_HAL_Driver
  * @{
  */

/** @addtogroup I2S
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup I2S_Exported_Types I2S Exported Types
  * @{
  */

/**
  * @brief I2S Init structure definition
  */
typedef struct
{
  uint32_t Mode;                            /*!< Specifies the I2S operating mode.
                                                 This parameter can be a value of @ref I2S_Mode                    */

  uint32_t Standard;                        /*!< Specifies the standard used for the I2S communication.
                                                 This parameter can be a value of @ref I2S_Standard                */

  uint32_t DataFormat;                      /*!< Specifies the data format for the I2S communication.
                                                 This parameter can be a value of @ref I2S_Data_Format             */

  uint32_t MCLKOutput;                      /*!< Specifies whether the I2S MCLK output is enabled or not.
                                                 This parameter can be a value of @ref I2S_MCLK_Output             */

  uint32_t AudioFreq;                       /*!< Specifies the frequency selected for the I2S communication.
                                                 This parameter can be a value of @ref I2S_Audio_Frequency         */

  uint32_t CPOL;                            /*!< Specifies the idle state of the I2S clock.
                                                 This parameter can be a value of @ref I2S_Clock_Polarity          */

  uint32_t FirstBit;                        /*!< Specifies whether data transfers start from MSB or LSB bit.
                                                 This parameter can be a value of @ref I2S_MSB_LSB_transmission    */

  uint32_t WSInversion;                     /*!< Control the Word Select Inversion.
                                                 This parameter can be a value of @ref I2S_WSInversion             */

  uint32_t IOSwap;                          /*!< Invert MISO/MOSI alternate functions
                                                 This parameter can be a value of @ref I2S_IO_Swap                 */

  uint32_t Data24BitAlignment;              /*!< Specifies the Data Padding for 24 bits data lenght
                                                 This parameter can be a value of @ref I2S_Data_24Bit_Alignment    */

  uint32_t FifoThreshold;                   /*!< Specifies the FIFO threshold level. 
                                                 This parameter can be a value of @ref I2S_Fifo_Threshold          */

  uint32_t MasterKeepIOState;               /*!< Control of Alternate function GPIOs state
                                                 This parameter can be a value of @ref I2S_Master_Keep_IO_State    */

  uint32_t SlaveExtendFREDetection;         /*!< Control the channel length in SLAVE.
                                                 This parameter can be a value of @ref I2S_SlaveExtendFREDetection */


}I2S_InitTypeDef;

/**
  * @brief  HAL State structures definition
  */
typedef enum
{
  HAL_I2S_STATE_RESET      = 0x00U,         /*!< I2S not yet initialized or disabled                */
  HAL_I2S_STATE_READY      = 0x01U,         /*!< I2S initialized and ready for use                  */
  HAL_I2S_STATE_BUSY       = 0x02U,         /*!< I2S internal process is ongoing                    */
  HAL_I2S_STATE_BUSY_TX    = 0x03U,         /*!< Data Transmission process is ongoing               */
  HAL_I2S_STATE_BUSY_RX    = 0x04U,         /*!< Data Reception process is ongoing                  */
  HAL_I2S_STATE_BUSY_TX_RX = 0x05U,         /*!< Data Transmission and Reception process is ongoing */
  HAL_I2S_STATE_TIMEOUT    = 0x06U,         /*!< I2S timeout state                                  */
  HAL_I2S_STATE_ERROR      = 0x07U          /*!< I2S error state                                    */
}HAL_I2S_StateTypeDef;

/**
  * @brief I2S handle Structure definition
  */
typedef struct __I2S_HandleTypeDef
{
  SPI_TypeDef               *Instance;                 /*!< I2S registers base address              */

