RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_i2s.h
  I2S_InitTypeDef            Init;                     /*!< I2S communication parameters            */

  uint16_t                  *pTxBuffPtr;               /*!< Pointer to I2S Tx transfer buffer       */

  __IO uint16_t              TxXferSize;               /*!< I2S Tx transfer size                    */

  __IO uint16_t              TxXferCount;              /*!< I2S Tx transfer Counter                 */

  uint16_t                  *pRxBuffPtr;               /*!< Pointer to I2S Rx transfer buffer       */

  __IO uint16_t              RxXferSize;               /*!< I2S Rx transfer size                    */

  __IO uint16_t              RxXferCount;              /*!< I2S Rx transfer counter                 */

  void (*RxISR)(struct __I2S_HandleTypeDef *hi2s);     /*!< function pointer on Rx ISR              */

  void (*TxISR)(struct __I2S_HandleTypeDef *hi2s);     /*!< function pointer on Tx ISR              */

  DMA_HandleTypeDef         *hdmatx;                   /*!< I2S Tx DMA handle parameters            */

  DMA_HandleTypeDef         *hdmarx;                   /*!< I2S Rx DMA handle parameters            */

  __IO HAL_LockTypeDef       Lock;                     /*!< I2S locking object                      */

  __IO HAL_I2S_StateTypeDef  State;                    /*!< I2S communication state                 */

  __IO uint32_t              ErrorCode;                /*!< I2S Error code                          */

}I2S_HandleTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup I2S_Exported_Constants I2S Exported Constants
  * @{
  */

/**
  * @defgroup  I2S_Error_Defintion I2S Error Defintion
  * @brief     I2S Error Code
  * @{
  */
#define HAL_I2S_ERROR_NONE                       (0x00000000U)    /*!< No error                    */
#define HAL_I2S_ERROR_UDR                        (0x00000001U)    /*!< I2S Underrun error          */
#define HAL_I2S_ERROR_OVR                        (0x00000002U)    /*!< I2S Overrun error           */
#define HAL_I2S_ERROR_FRE                        (0x00000004U)    /*!< I2S Frame format error      */
#define HAL_I2S_ERROR_DMA                        (0x00000008U)    /*!< DMA transfer error          */
#define HAL_I2S_ERROR_DMA                        (0x00000008U)    /*!< DMA transfer error          */
#define HAL_I2S_ERROR_TIMEOUT                    (0x00000010U)    /*!< Timeout error               */
#define HAL_I2S_ERROR_PRESCALER                  (0x00000020U)    /*!< Prescaler error             */
  /**
    * @}
    */

/** @defgroup I2S_Mode I2S Mode
  * @{
  */
#define I2S_MODE_SLAVE_TX                        (0x00000000U)
#define I2S_MODE_SLAVE_RX                        (0x00000002U)
#define I2S_MODE_MASTER_TX                       (0x00000004U)
#define I2S_MODE_MASTER_RX                       (0x00000006U)
#define I2S_MODE_SLAVE_FD                        (0x00000008U)
#define I2S_MODE_MASTER_FD                       (0x0000000AU)
/**
  * @}
  */

/** @defgroup I2S_Standard I2S Standard
  * @{
  */
#define I2S_STANDARD_PHILIPS                     (0x00000000U)
#define I2S_STANDARD_MSB                         (0x00000010U)
#define I2S_STANDARD_LSB                         (0x00000020U)
#define I2S_STANDARD_PCM_SHORT                   (0x00000030U)
#define I2S_STANDARD_PCM_LONG                    (0x000000B0U)
/**
  * @}
  */

/** @defgroup I2S_Data_Format I2S Data Format
  * @{
  */
#define I2S_DATAFORMAT_16B                       (0x00000000U)
#define I2S_DATAFORMAT_16B_EXTENDED              (0x00000400U)
#define I2S_DATAFORMAT_24B                       (0x00000500U)
#define I2S_DATAFORMAT_32B                       (0x00000600U)
/**
  * @}
  */

/** @defgroup I2S_MCLK_Output I2S MCLK Output
  * @{
  */
#define I2S_MCLKOUTPUT_ENABLE                    SPI_I2SCFGR_MCKOE
#define I2S_MCLKOUTPUT_DISABLE                   (0x00000000U)
/**
  * @}
  */

/** @defgroup I2S_Audio_Frequency I2S Audio Frequency
  * @{
  */
#define I2S_AUDIOFREQ_192K                       (192000U)
#define I2S_AUDIOFREQ_96K                        (96000U)
#define I2S_AUDIOFREQ_48K                        (48000U)
#define I2S_AUDIOFREQ_44K                        (44100U)
#define I2S_AUDIOFREQ_32K                        (32000U)
#define I2S_AUDIOFREQ_22K                        (22050U)
#define I2S_AUDIOFREQ_16K                        (16000U)
#define I2S_AUDIOFREQ_11K                        (11025U)
#define I2S_AUDIOFREQ_8K                         (8000U)
#define I2S_AUDIOFREQ_DEFAULT                    (2U)
/**
  * @}
  */

/** @defgroup I2S_Clock_Polarity I2S Clock Polarity
  * @{
  */
#define I2S_CPOL_LOW                            (0x00000000U)
#define I2S_CPOL_HIGH                           SPI_I2SCFGR_CKPOL
/**
  * @}
  */

/** @defgroup I2S_MSB_LSB_transmission I2S MSB LSB Transmission
  * @{
  */
#define I2S_FIRSTBIT_MSB                        (0x00000000U)
#define I2S_FIRSTBIT_LSB                        SPI_CFG2_LSBFRST
/**
  * @}
  */

/** @defgroup I2S_WSInversion I2S Word Select Inversion
  * @{
  */
#define I2S_WS_INVERSION_DISABLE                (0x00000000U)
#define I2S_WS_INVERSION_ENABLE                 SPI_I2SCFGR_WSINV
/**
  * @}
  */

/** @defgroup I2S_IO_Swap Control I2S IO Swap
  * @{
  */ 
#define I2S_IO_SWAP_DISABLE                     (0x00000000U)
#define I2S_IO_SWAP_ENABLE                      SPI_CFG2_IOSWP
/**
  * @}
  */

/** @defgroup I2S_Data_24Bit_Alignment Data Padding 24Bit
  * @{
  */ 
#define I2S_DATA_24BIT_ALIGNMENT_RIGHT         (0x00000000U)
#define I2S_DATA_24BIT_ALIGNMENT_LEFT          SPI_I2SCFGR_DATFMT
/**
  * @}
  */

/** @defgroup I2S_Fifo_Threshold I2S Fifo Threshold
  * @{
  */
#define I2S_FIFO_THRESHOLD_01DATA              (0x00000000U)
#define I2S_FIFO_THRESHOLD_02DATA              (0x00000020U)
#define I2S_FIFO_THRESHOLD_03DATA              (0x00000040U)
#define I2S_FIFO_THRESHOLD_04DATA              (0x00000060U)
#define I2S_FIFO_THRESHOLD_05DATA              (0x00000080U)
#define I2S_FIFO_THRESHOLD_06DATA              (0x000000A0U)
#define I2S_FIFO_THRESHOLD_07DATA              (0x000000C0U)
#define I2S_FIFO_THRESHOLD_08DATA              (0x000000E0U)
/**
  * @}
  */

/** @defgroup I2S_Master_Keep_IO_State Keep IO State
  * @{
  */
#define I2S_MASTER_KEEP_IO_STATE_DISABLE       (0x00000000U)
#define I2S_MASTER_KEEP_IO_STATE_ENABLE        SPI_CFG2_AFCNTR
/**
  * @}
  */

/** @defgroup I2S_SlaveExtendFREDetection Slave Extend FRE Detection
  * @{
  */
#define I2S_SLAVE_EXTEND_FRE_DETECTION_DISABLE (0x00000000U)
#define I2S_SLAVE_EXTEND_FRE_DETECTION_ENABLE  SPI_I2SCFGR_FIXCH
/**
  * @}
  */

/** @defgroup I2S_Interrupt_definition I2S Interrupt definition
  * @{
  */
#define I2S_IT_TXE                             SPI_IER_TXPIE
#define I2S_IT_RXNE                            SPI_IER_RXPIE
#define I2S_IT_ERR                            (SPI_IER_OVRIE | SPI_IER_UDRIE | SPI_IER_TIFREIE)

/**
  * @}
  */

/** @defgroup I2S_Flag_definition I2S Flag definition
  * @{
  */
#define I2S_FLAG_TXE                           SPI_SR_TXP     /* I2S status flag: Tx buffer empty flag           */
#define I2S_FLAG_RXNE                          SPI_SR_RXP     /* I2S status flag: Rx buffer not empty flag       */
#define I2S_FLAG_UDR                           SPI_SR_UDR     /* I2S Error flag: Underrun flag                   */
#define I2S_FLAG_RXWNE                         SPI_SR_RXWNE   /* I2S RxFIFO Word Not Empty                       */
#define I2S_FLAG_OVR                           SPI_SR_OVR     /* I2S Error flag: Overrun flag                    */
#define I2S_FLAG_FRE                           SPI_SR_TIFRE   /* I2S Error flag: TI mode frame format error flag */
/**
  * @}
  */
  
/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup I2S_Exported_Macros I2S Exported Macros
  * @{
  */

