RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_i2s.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup I2S_Private I2S Private
  * @{
  */
#define IS_I2S_MODE(MODE)         (((MODE) == I2S_MODE_SLAVE_TX)  || \
                                   ((MODE) == I2S_MODE_SLAVE_RX)  || \
                                   ((MODE) == I2S_MODE_MASTER_TX) || \
                                   ((MODE) == I2S_MODE_MASTER_RX) || \
                                   ((MODE) == I2S_MODE_SLAVE_FD)  || \
                                   ((MODE) == I2S_MODE_MASTER_FD))

#define IS_I2S_FD_MODE(MODE)      (((MODE) == I2S_MODE_SLAVE_FD)  || \
                                   ((MODE) == I2S_MODE_MASTER_FD))

#define IS_I2S_MASTER(MODE)       (((MODE) == I2S_MODE_MASTER_TX)  || \
                                   ((MODE) == I2S_MODE_MASTER_RX) || \
                                   ((MODE) == I2S_MODE_MASTER_FD))

#define IS_I2S_TX_MODE(MODE)      (((MODE) == I2S_MODE_SLAVE_TX)  || \
                                   ((MODE) == I2S_MODE_MASTER_TX) || \
                                   ((MODE) == I2S_MODE_SLAVE_FD)  || \
                                   ((MODE) == I2S_MODE_MASTER_FD))

#define IS_I2S_RX_MODE(MODE)      (((MODE) == I2S_MODE_SLAVE_RX)  || \
                                   ((MODE) == I2S_MODE_MASTER_RX) || \
                                   ((MODE) == I2S_MODE_SLAVE_FD)  || \
                                   ((MODE) == I2S_MODE_MASTER_FD))

#define IS_I2S_STANDARD(STANDARD) (((STANDARD) == I2S_STANDARD_PHILIPS)   || \
                                   ((STANDARD) == I2S_STANDARD_MSB)       || \
                                   ((STANDARD) == I2S_STANDARD_LSB)       || \
                                   ((STANDARD) == I2S_STANDARD_PCM_SHORT) || \
                                   ((STANDARD) == I2S_STANDARD_PCM_LONG))

#define IS_I2S_DATA_FORMAT(FORMAT) (((FORMAT) == I2S_DATAFORMAT_16B)          || \
                                    ((FORMAT) == I2S_DATAFORMAT_16B_EXTENDED) || \
                                    ((FORMAT) == I2S_DATAFORMAT_24B)          || \
                                    ((FORMAT) == I2S_DATAFORMAT_32B))

#define IS_I2S_MCLK_OUTPUT(OUTPUT) (((OUTPUT) == I2S_MCLKOUTPUT_ENABLE) || \
                                    ((OUTPUT) == I2S_MCLKOUTPUT_DISABLE))

#define IS_I2S_AUDIO_FREQ(FREQ)   ((((FREQ) >= I2S_AUDIOFREQ_8K)    && \
                                    ((FREQ) <= I2S_AUDIOFREQ_192K)) || \
                                    ((FREQ) == I2S_AUDIOFREQ_DEFAULT))

#define IS_I2S_CPOL(CPOL)          (((CPOL) == I2S_CPOL_LOW) || \
                                    ((CPOL) == I2S_CPOL_HIGH))

#define IS_I2S_FIRST_BIT(FIRSTBIT) (((FIRSTBIT) == I2S_FIRSTBIT_MSB) || \
                                    ((FIRSTBIT) == I2S_FIRSTBIT_LSB))

#define IS_I2S_WS_INVERSION(WSINV) (((WSINV) == I2S_WS_INVERSION_DISABLE) || \
                                    ((WSINV) == I2S_WS_INVERSION_ENABLE))

#define IS_I2S_IO_SWAP(IOSWAP)     (((IOSWAP) == I2S_IO_SWAP_DISABLE) || \
                                    ((IOSWAP) == I2S_IO_SWAP_ENABLE))

#define IS_I2S_DATA_24BIT_ALIGNMENT(ALIGNMENT)  (((ALIGNMENT) == I2S_DATA_24BIT_ALIGNMENT_RIGHT) || \
                                                 ((ALIGNMENT) == I2S_DATA_24BIT_ALIGNMENT_LEFT))

#define IS_I2S_FIFO_THRESHOLD(FTHLV) (((FTHLV) == I2S_FIFO_THRESHOLD_01DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_02DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_03DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_04DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_05DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_06DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_07DATA) || \
                                      ((FTHLV) == I2S_FIFO_THRESHOLD_08DATA))

#define IS_I2S_MASTER_KEEP_IO_STATE(AFCNTR)      (((AFCNTR) == I2S_MASTER_KEEP_IO_STATE_DISABLE) || \
                                                  ((AFCNTR) == I2S_MASTER_KEEP_IO_STATE_ENABLE))

#define IS_I2S_SLAVE_EXTEND_FRE_DETECTION(FIXCH) (((FIXCH) == I2S_SLAVE_EXTEND_FRE_DETECTION_DISABLE) || \
                                                  ((FIXCH) == I2S_SLAVE_EXTEND_FRE_DETECTION_ENABLE))

/**
  * @}
  */

/* Define the private group ***************************************************/
/******************************************************************************/
/** @defgroup I2S_Private I2S Private
  * @{
  */
/**
  * @}
  */
/******************************************************************************/
/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
}
#endif



#endif /* __STM32H7xx_HAL_I2S_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
